In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
driver_ids = pd.read_csv("driver_ids.csv")

In [3]:
ride_ids = pd.read_csv("ride_ids.csv")

In [4]:
ride_timestamps = pd.read_csv("ride_timestamps.csv")

In [5]:
driver_ids.head(5)

                          driver_id  driver_onboard_date
0  002be0ffdc997bd5c50703158b7c2491  2016-03-29 00:00:00
1  007f0389f9c7b03ef97098422f902e62  2016-03-29 00:00:00
2  011e5c5dfc5c2c92501b8b24d47509bc  2016-04-05 00:00:00
3  0152a2f305e71d26cc964f8d4411add9  2016-04-23 00:00:00
4  01674381af7edd264113d4e6ed55ecda  2016-04-29 00:00:00

In [6]:
ride_ids.head(5)

,driver_id,ride_id,ride_distance,ride_duration,ride_prime_time
0,002be0ffdc997bd5c50703158b7c2491,006d61cf7446e682f7bc50b0f8a5bea5,1811,327,50
1,002be0ffdc997bd5c50703158b7c2491,01b522c5c3a756fbdb12e95e87507eda,3362,809,0
2,002be0ffdc997bd5c50703158b7c2491,029227c4c2971ce69ff2274dc798ef43,3282,572,0
3,002be0ffdc997bd5c50703158b7c2491,034e861343a63ac3c18a9ceb1ce0ac69,65283,3338,25
4,002be0ffdc997bd5c50703158b7c2491,034f2e614a2f9fc7f1c2f77647d1b981,4115,823,100

In [7]:
ride_timestamps.head()

                            ride_id           event            timestamp
0  00003037a262d9ee40e61b5c0718f7f0    requested_at  2016-06-13 09:39:19
1  00003037a262d9ee40e61b5c0718f7f0     accepted_at  2016-06-13 09:39:51
2  00003037a262d9ee40e61b5c0718f7f0      arrived_at  2016-06-13 09:44:31
3  00003037a262d9ee40e61b5c0718f7f0    picked_up_at  2016-06-13 09:44:33
4  00003037a262d9ee40e61b5c0718f7f0  dropped_off_at  2016-06-13 10:03:05

In [8]:
df = ride_ids

In [9]:
#ride_ids["ride_fare"] = (ride_ids["ride_distance"])
ride_fare = []
short_ride = []
long_ride = []
for index, row in ride_ids.iterrows():
    distance = row["ride_distance"]/(1609.344)
    duration = row["ride_duration"]/(60)
    fare = round((2 + 1.15*distance + 0.22*duration),2) 
    ride_fare.append(fare)
    if row["ride_distance"] <= 2456:
        short_ride.append(1)
        long_ride.append(0)
    elif row["ride_distance"] >= 7166:
        short_ride.append(0)
        long_ride.append(1)
    else:
        short_ride.append(0)
        long_ride.append(0)

In [10]:
df["ride_fare"] = ride_fare

In [11]:
df["short_ride"] = short_ride

In [12]:
df["long_ride"] = long_ride

In [13]:
df.head(10)

,driver_id,ride_id,ride_distance,ride_duration,ride_prime_time,ride_fare,short_ride,long_ride
0,002be0ffdc997bd5c50703158b7c2491,006d61cf7446e682f7bc50b0f8a5bea5,1811,327,50,4.49,1,0
1,002be0ffdc997bd5c50703158b7c2491,01b522c5c3a756fbdb12e95e87507eda,3362,809,0,7.37,0,0
2,002be0ffdc997bd5c50703158b7c2491,029227c4c2971ce69ff2274dc798ef43,3282,572,0,6.44,0,0
3,002be0ffdc997bd5c50703158b7c2491,034e861343a63ac3c18a9ceb1ce0ac69,65283,3338,25,60.89,0,1
4,002be0ffdc997bd5c50703158b7c2491,034f2e614a2f9fc7f1c2f77647d1b981,4115,823,100,7.96,0,0
5,002be0ffdc997bd5c50703158b7c2491,03d6b9d80b8a96135cb9b25178e9e203,4832,917,100,8.82,0,0
6,002be0ffdc997bd5c50703158b7c2491,04053c0ed21761e07f0b869cab5b7dd0,1575,347,0,4.40,1,0
7,002be0ffdc997bd5c50703158b7c2491,0534d432e0186625f623aaee57af98be,3056,687,25,6.70,0,0
8,002be0ffdc997bd5c50703158b7c2491,053a1621c0affcd2b9c517af5c2bc843,3940,1143,75,9.01,0,0
9,002be0ffdc997bd5c50703158b7c2491,066e92c52f59486de56cd7b8716a4ca6,3957,868,50,8.01,0,0

In [46]:
#def add_collumn(name):
#    a = df.groupby("driver_id")[name].sum()
#    a_df = a.to_frame()
#    a_df['driver_id'] = a_df.index
#    new_df = pd.merge(driver_ids, a_df)
#    return new_df

In [48]:
#add_collumn("short_ride")

In [22]:
#df[(df.driver_id == '7c27405cefee2fad79a81a819ca9dbe1')].nunique()

driver_id            1
ride_id            475
ride_distance      470
ride_duration      413
ride_prime_time      6
ride_fare          429
dtype: int64

In [14]:
fare_per_driver = df.groupby("driver_id")["ride_fare"].sum()

In [15]:
fare_per_driver.head(10)

driver_id
002be0ffdc997bd5c50703158b7c2491    2608.77
007f0389f9c7b03ef97098422f902e62     221.13
011e5c5dfc5c2c92501b8b24d47509bc     367.79
0152a2f305e71d26cc964f8d4411add9    2073.24
01674381af7edd264113d4e6ed55ecda    4292.81
0213f8b59219e32142711992ca4ec01f    2254.24
021e5cd15ef0bb3ec20a12af99e142b3     475.11
0258e250ca195cc6258cbdc75aecd853    3352.07
028b5a4dcd7f4924ebfabcf2e814c014    4121.37
02d6a6b8a6da15fc219a9570f7ebbe78    1620.89
Name: ride_fare, dtype: float64

In [16]:
type(fare_per_driver)

pandas.core.series.Series

In [17]:
fare_df = fare_per_driver.to_frame()

In [18]:
fare_df.head()

                                  ride_fare
driver_id
002be0ffdc997bd5c50703158b7c2491    2608.77
007f0389f9c7b03ef97098422f902e62     221.13
011e5c5dfc5c2c92501b8b24d47509bc     367.79
0152a2f305e71d26cc964f8d4411add9    2073.24
01674381af7edd264113d4e6ed55ecda    4292.81

In [19]:
fare_df['driver_id'] = fare_df.index

In [20]:
fare_df.head()

                                  ride_fare                         driver_id
driver_id
002be0ffdc997bd5c50703158b7c2491    2608.77  002be0ffdc997bd5c50703158b7c2491
007f0389f9c7b03ef97098422f902e62     221.13  007f0389f9c7b03ef97098422f902e62
011e5c5dfc5c2c92501b8b24d47509bc     367.79  011e5c5dfc5c2c92501b8b24d47509bc
0152a2f305e71d26cc964f8d4411add9    2073.24  0152a2f305e71d26cc964f8d4411add9
01674381af7edd264113d4e6ed55ecda    4292.81  01674381af7edd264113d4e6ed55ecda

In [21]:
fare_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 937 entries, 002be0ffdc997bd5c50703158b7c2491 to ffff51a71f2f185ec5e97d59dbcd7a78
Data columns (total 2 columns):
ride_fare    937 non-null float64
driver_id    937 non-null object
dtypes: float64(1), object(1)
memory usage: 22.0+ KB

In [22]:
df2 = pd.merge(driver_ids, fare_df)

C:\Users\KHANH TM NGUYEN\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: FutureWarning: 'driver_id' is both an index level and a column label.
Defaulting to column, but this will raise an ambiguity error in a future version
  exec(code_obj, self.user_global_ns, self.user_ns)

In [23]:
df2.head()

                          driver_id  driver_onboard_date  ride_fare
0  002be0ffdc997bd5c50703158b7c2491  2016-03-29 00:00:00    2608.77
1  007f0389f9c7b03ef97098422f902e62  2016-03-29 00:00:00     221.13
2  011e5c5dfc5c2c92501b8b24d47509bc  2016-04-05 00:00:00     367.79
3  0152a2f305e71d26cc964f8d4411add9  2016-04-23 00:00:00    2073.24
4  01674381af7edd264113d4e6ed55ecda  2016-04-29 00:00:00    4292.81

In [24]:
short_ride_df = df.groupby("driver_id")["short_ride"].sum().to_frame()

In [25]:
short_ride_df.head()

                                  short_ride
driver_id
002be0ffdc997bd5c50703158b7c2491          72
007f0389f9c7b03ef97098422f902e62          10
011e5c5dfc5c2c92501b8b24d47509bc          11
0152a2f305e71d26cc964f8d4411add9          33
01674381af7edd264113d4e6ed55ecda          83

In [26]:
short_ride_df['driver_id'] = short_ride_df.index

In [32]:
df3 = pd.merge(df2, short_ride_df)

C:\Users\KHANH TM NGUYEN\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: FutureWarning: 'driver_id' is both an index level and a column label.
Defaulting to column, but this will raise an ambiguity error in a future version
  exec(code_obj, self.user_global_ns, self.user_ns)

In [33]:
df3.head()

,driver_id,driver_onboard_date,ride_fare,short_ride
0,002be0ffdc997bd5c50703158b7c2491,2016-03-29 00:00:00,2608.77,72
1,007f0389f9c7b03ef97098422f902e62,2016-03-29 00:00:00,221.13,10
2,011e5c5dfc5c2c92501b8b24d47509bc,2016-04-05 00:00:00,367.79,11
3,0152a2f305e71d26cc964f8d4411add9,2016-04-23 00:00:00,2073.24,33
4,01674381af7edd264113d4e6ed55ecda,2016-04-29 00:00:00,4292.81,83

In [34]:
long_ride_df = df.groupby("driver_id")["long_ride"].sum().to_frame()

In [35]:
long_ride_df['driver_id'] = long_ride_df.index

In [36]:
long_ride_df.head()

                                  long_ride                         driver_id
driver_id
002be0ffdc997bd5c50703158b7c2491         52  002be0ffdc997bd5c50703158b7c2491
007f0389f9c7b03ef97098422f902e62          2  007f0389f9c7b03ef97098422f902e62
011e5c5dfc5c2c92501b8b24d47509bc          7  011e5c5dfc5c2c92501b8b24d47509bc
0152a2f305e71d26cc964f8d4411add9         69  0152a2f305e71d26cc964f8d4411add9
01674381af7edd264113d4e6ed55ecda        125  01674381af7edd264113d4e6ed55ecda

In [37]:
df4 = pd.merge(df3, long_ride_df)

C:\Users\KHANH TM NGUYEN\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: FutureWarning: 'driver_id' is both an index level and a column label.
Defaulting to column, but this will raise an ambiguity error in a future version
  exec(code_obj, self.user_global_ns, self.user_ns)

In [38]:
df4.head()

,driver_id,driver_onboard_date,ride_fare,short_ride,long_ride
0,002be0ffdc997bd5c50703158b7c2491,2016-03-29 00:00:00,2608.77,72,52
1,007f0389f9c7b03ef97098422f902e62,2016-03-29 00:00:00,221.13,10,2
2,011e5c5dfc5c2c92501b8b24d47509bc,2016-04-05 00:00:00,367.79,11,7
3,0152a2f305e71d26cc964f8d4411add9,2016-04-23 00:00:00,2073.24,33,69
4,01674381af7edd264113d4e6ed55ecda,2016-04-29 00:00:00,4292.81,83,125

In [39]:
df4.describe()

         ride_fare  short_ride   long_ride
count   854.000000  854.000000  854.000000
mean   2200.286628   54.391101   54.375878
std    1791.426770   47.250416   45.806007
min      19.350000    1.000000    0.000000
25%     486.542500   11.000000   14.000000
50%    2158.600000   53.000000   49.000000
75%    3377.765000   84.000000   82.000000
max    9121.790000  252.000000  281.000000

In [40]:
# Look at the drivers making least and most revenue 
df4.sort_values("ride_fare").head()

,driver_id,driver_onboard_date,ride_fare,short_ride,long_ride
430,7b625f643d0775f0ac4898e33235377b,2016-04-04 00:00:00,19.35,1,0
447,7ff85c5c0e9324e28d1e0d0589c364bd,2016-04-19 00:00:00,29.62,1,1
841,fd831ca1d79ae5c6fc3a679a22e5b8cf,2016-05-07 00:00:00,138.55,3,1
713,d31eded9263eab43f614eecc6a52a0f5,2016-05-07 00:00:00,157.94,4,2
390,706466935b9e1d04e4e116be7ce90ea9,2016-04-01 00:00:00,175.36,3,3

In [41]:
df4.sort_values("ride_fare").tail()

,driver_id,driver_onboard_date,ride_fare,short_ride,long_ride
274,4eb382d1f7d50fae1294964263d1ce82,2016-04-06 00:00:00,7818.70,245,168
664,c07499b5a6f1090f2fb263ec6ac0660c,2016-04-01 00:00:00,7862.53,136,223
461,844e9be5a30d8d9c1f8e9ddb086ff717,2016-04-15 00:00:00,7917.69,200,197
189,3788dc9e91f1548816ce8b5af07ddadc,2016-04-26 00:00:00,8834.42,219,215
316,5ccc0e6dc9c7475caf785cdce7b8eb7a,2016-04-05 00:00:00,9121.79,231,249

In [ ]:
# Create a new collumn: "last ride" to calculate the number of months the drivers are active 
# Return the date/time of the last driver according to "dropped_off_at", timestamp and driver_id
#last_ride = []
#for index, row in df3.iterrows():
#    distance = row["ride_distance"]/(1609.344)
#    duration = row["ride_duration"]/(60)
#    fare = round((2 + 1.15*distance + 0.22*duration),2) 
#    ride_fare.append(fare)

In [31]:
# Sort according to onboarding date 
driver_ids.sort_values("driver_onboard_date").head()

                            driver_id  driver_onboard_date
432  72ca99bb6667024a23e1f68904b06fd0  2016-03-28 00:00:00
907  f86eb77e1cefe28e9f0e9d3775fae261  2016-03-28 00:00:00
107  1e9b964b3e3d0289794289579269247a  2016-03-28 00:00:00
895  f1b4411717c78f67380366c2a16a4d1e  2016-03-28 00:00:00
889  f0df79d10df44f18742682108b17f60a  2016-03-28 00:00:00

In [32]:
driver_ids.sort_values("driver_onboard_date").tail()

                            driver_id  driver_onboard_date
165  2e5d7b104b570a5cf450f6825880c9dc  2016-05-15 00:00:00
909  f98673773627b4b8d152e2b168b85bb2  2016-05-15 00:00:00
822  df9ab418e87b21319bdfe389a4552e08  2016-05-15 00:00:00
926  fdbee494c73577d5b1266d1fec5c6c9a  2016-05-15 00:00:00
142  28a396a3e1793b64046aaaf8345604ec  2016-05-15 00:00:00